Repository: cvicentiu/mariadb-10.0
Catalog: debian/po/*.po
Languages: pt

source: Really proceed with downgrade?
pt: Deseja mesmo continuar com o downgrade?

source: A file named /var/lib/mysql/debian-*.flag exists on this system.
pt: Existe um ficheiro chamado /var/lib/mysql/debian-*.flag neste sistema.

source: Such a file is an indication that a mariadb-server package with a higher version has been installed previously.
pt: Tal ficheiro significa que anteriormente já foi instalado um pacote mariadb-server com um número de versão superior.

source: There is no guarantee that the version you're currently installing will be able to use the current databases.
pt: Não existe nenhuma garantia que a versão que está actualmente a instalar seja capaz de utilizar as actuais bases de dados.

source: Important note for NIS/YP users
pt: Nota importante para os utilizadores de NIS/YP

source: Using MariaDB under NIS/YP requires a mysql user account to be added on the local system with:
pt: Utilizar MariaDB com NIS/YP necessita de uma conta de utilizador de mysql para ser acrescentada ao sistema local com:

source: You should also check the permissions and ownership of the /var/lib/mysql directory:
pt: Deve também verificar as permissões e o dono do directório /var/lib/mysql:

source: Remove all MariaDB databases?
pt: Remover todas as bases de dados MariaDB?

source: The /var/lib/mysql directory which contains the MariaDB databases is about to be removed.
pt: O directório /var/lib/mysql que contém as bases de dados MariaDB está prestes a ser removido.

source: If you're removing the MariaDB package in order to later install a more recent version or if a different mariadb-server package is already using it, the data should be kept.
pt: Se está a remover o pacote MariaDB de forma a posteriormente instalar uma versão mais recente ou se um pacote mariadb-server já o está a utilizar, então os dados devem ser mantidos.

source: New password for the MariaDB "root" user:
pt: Nova palavra-passe para o utilizador "root" do MariaDB:

source: While not mandatory, it is highly recommended that you set a password for the MariaDB administrative "root" user.
pt: Embora não seja mandatório, é fortemente recomendado que defina uma palavra-passe para o utilizador administrativo "root" do MariaDB.

source: If this field is left blank, the password will not be changed.
pt: Se este campo for deixado em branco, a palavra-passe não será alterada.

source: Repeat password for the MariaDB "root" user:
pt: Repita a palavra-passe para o utilizador "root" do MariaDB:

source: Unable to set password for the MariaDB "root" user
pt: Não foi possível definir a palavra-passe para o utilizador "root" de MariaDB

source: An error occurred while setting the password for the MariaDB administrative user. This may have happened because the account already has a password, or because of a communication problem with the MariaDB server.
pt: Ocorreu um erro enquanto era definida a palavra-passe para o utilizador administrativo do MariaDB. Isto pode ter acontecido porque a conta já tem uma palavra-passe, ou porque ocorreu um problema de comunicação com o servidor MariaDB.

source: You should check the account's password after the package installation.
pt: Deve verificar a palavra-passe da conta após a instalação do pacote.

source: Please read the /usr/share/doc/mariadb-server-10.0/README.Debian file for more information.
pt: Para mais informações por favor leia o ficheiro /usr/share/doc/mariadb-server-10.0/README.Debian.

source: Password input error
pt: Erro de introdução de palavra-passe

source: The two passwords you entered were not the same. Please try again.
pt: As duas palavras-passe que introduziu não são iguais. Por favor tente novamente.

source: NDB Cluster seems to be in use
pt: Parece estar em uso o NDB Cluster

source: MySQL-5.1 no longer provides NDB Cluster support. Please migrate to the new mysql-cluster package and remove all lines starting with "ndb" from all config files below /etc/mysql/.
pt: MySQL-5.1 já não disponibiliza suporte para NDB Cluster. Por favor migre para o novo pacote mysql-cluster e remova as linhas que começam com "ndb" de todos os ficheiros de configuração em /etc/mysql/.

source: Really migrate to MariaDB?
pt: Realmente migrar para MariaDB?

source: MariaDB is a drop-in replacement for MySQL. It will use your current configuration file (my.cnf) and current databases.
pt: MariaDB é um substituto para MySQL. Irá utilizar o seu ficheiro actual de configuração (my.cnf) e bases de dados.

source: Note that MariaDB has some enhanced features, which do not exist in MySQL and thus migration back to MySQL might not always work, at least not as automatically as migrating from MySQL to MariaDB.
pt: Note que MariaDB tem algumas funcionalidades melhoradas, as quais não existem em MySQL e por isso a migração de volta para MySQL poderá nem sempre funcionar, pelo menos não automaticamente como a migração de MySQL para MariaDB.
